<a href="https://colab.research.google.com/github/mcmbegbu/Tic-Tac-Toe/blob/master/Python_Master_Class.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Jupyther notebook: Julia, Python, Rstudio

*Data Types*

Integers: Whole numbers without a decimal e.g 1000

Floats: Numbers with decimal e.g 100.05

Objects: Numbers, words, character e.g Deji, 1000, W deji1000

Strings: Numbers, character but with a " e.g "Deji", "1000", "W'

In [0]:
100 + 1000

1100

In [0]:
20.05 + 10.0114

30.0614

Operators: +, -, *, /

The assign Operator =

The Equal to Operator ==

Function is an Operator that comes with a parenthesis ()

In [0]:
a = 100
b = 200
c = 300


#Use +, -, *, /

In [0]:
  a + b

300

In [0]:
#Create a list of letters from d to k inside a brace []

my_list = ["a", "b", "d", "e", "f"] 
print(my_list)

['a', 'b', 'd', 'e', 'f']

In [0]:
type(my_list)

list

#Create a list of letters from d to k inside a brace []

my_list = ["a", "b", "d", "e", "f"]
print(my_list)

In [0]:
my_list2 = ["85", "Michael"]
type(my_list2)

list

In [0]:
type

Tuples are also a list of items, but are immutable and created with round () brackets

List are group of items, they are mutable and created with square brackets. They are heterogenous.

In [0]:
my_tuple = ("78", "Green", "Jasmine", "99", "Ottawa")
print(my_tuple)

('78', 'Green', 'Jasmine', '99', 'Ottawa')

Coercing: which means changing the data type of a variable from one datatype to another

In [0]:
x = 30.03
type(x)

float

The following functions perform coercing tasks:

* int() converts a variable to an integer datatype
* float() converts a variable to float datatype
* str() converts a variable to string datatype
* list() converts a variable to a list datatype
* tuple() converts a variable to a tuple datatype

In [0]:
x = int(x)
print(x)

30

Indexing: Indexing means extracting items or a number of items from a list of object

In [0]:
my_list

['a', 'b', 'd', 'e', 'f']

In [0]:
my_list[0]

'a'

In [0]:
#Indexing a range of numbers
my_list[0:2] #When it comes to subsetting a range of number, the first number is included, while the last number is excluded.

['a', 'b']

In [0]:
my_list3 = ["z", "c", "v", "t", "b", "n", "m", "l", "k",  "j"]
print(my_list3)

['z', 'c', 'v', 't', 'b', 'n', 'm', 'l', 'k', 'j']

In [0]:
my_list3 [0:5]

['z', 'c', 'v', 't', 'b']

In [0]:
my_list3 [5:10]

['n', 'm', 'l', 'k', 'j']

Assignment: Check how to create sets and dictionaries

Variable assignment operator, takes what is on the right and saves in the left

In [0]:
my_list3[9]

'j'

In [0]:
my_list3[9] = 3
print(my_list3)

['z', 'c', 'v', 't', 'b', 'n', 'm', 'l', 'k', 3]

In [0]:
my_tuple2 = (2, 3, 4, 5, 6)
print(my_tuple2)

(2, 3, 4, 5, 6)

In [0]:
my_tuple3 = list(my_tuple2)
print(my_tuple3)

[2, 3, 4, 5, 6]

Working with a dataset in Python

In [0]:
import pandas as pd
import matplotlib.pyplot as plt

In [0]:
#Import laptop sales data
df = pd.read_csv("Laptop Sales.csv")

In [0]:
df

    Transaction_date          Product  ...   Latitude   Longitude
0      1/2/2009 6:17    Silver Laptop  ...  51.500000   -1.116667
1      1/2/2009 4:53    Silver Laptop  ...  39.195000  -94.681940
2     1/2/2009 13:08    Silver Laptop  ...  46.188060 -123.830000
3     1/3/2009 14:44    Silver Laptop  ... -36.133333  144.750000
4     1/4/2009 12:56      Gold Laptop  ...  33.520560  -86.802500
..               ...              ...  ...        ...         ...
993  1/22/2009 14:25    Silver Laptop  ...  54.583333   -5.933333
994   1/28/2009 5:36      Gold Laptop  ... -20.360278   57.366111
995    1/1/2009 4:24  Platinum Laptop  ...  42.946940  -76.429440
996   1/8/2009 11:55    Silver Laptop  ...  52.083333    0.433333
997  1/12/2009 21:30    Silver Laptop  ...  43.073060  -89.401110

[998 rows x 12 columns]

In [0]:
df.dtypes

Transaction_date     object
Product              object
Price                 int64
Payment_Type         object
Name                 object
City                 object
State                object
Country              object
Account_Created      object
Last_Login           object
Latitude            float64
Longitude           float64
dtype: object

In [0]:
df.describe()

#descriptive statistics of numeric column

              Price    Latitude   Longitude
count    998.000000  998.000000  998.000000
mean    1633.767535   39.015705  -41.337820
std     1156.034724   19.508572   67.389479
min      250.000000  -41.465000 -159.485280
25%     1200.000000   35.816944  -87.991670
50%     1200.000000   42.320695  -73.730695
75%     1200.000000   51.050000    4.916667
max    13000.000000   64.837780  174.766667

In [0]:
#A
df[["Price", "Product", "Name"]]

     Price          Product               Name
0     1200    Silver Laptop           carolina
1     1200    Silver Laptop             Betina
2     1200    Silver Laptop  Federica e Andrea
3     1200    Silver Laptop              Gouya
4     3600      Gold Laptop            Gerd W
..     ...              ...                ...
993   1200    Silver Laptop         Hans-Joerg
994   3600      Gold Laptop         Christiane
995   7500  Platinum Laptop             Pamela
996   1200    Silver Laptop              julie
997   1200    Silver Laptop             Julia

[998 rows x 3 columns]

In [0]:
#A
df["Product"].value_counts()

Silver Laptop       847
Gold Laptop         136
Platinum Laptop      14
Platinum Laptop       1
Name: Product, dtype: int64

In [0]:
#A
df["City"].value_counts()

London                          19
Calgary                         11
New York                         9
Den Haag                         9
Vancouver                        8
                                ..
Walnut Creek                     1
Kobenhavn                        1
Irving                           1
Pittsboro                        1
Besancon                         1
Name: City, Length: 759, dtype: int64

In [0]:
#

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 998 entries, 0 to 997
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  998 non-null    object
 1   Product           998 non-null    object
 2   Price             998 non-null    int64
 3   Payment_Type      998 non-null    object
 4   Name              998 non-null    object
 5   City              998 non-null    object
 6   State             997 non-null    object
 7   Country           998 non-null    object
 8   Account_Created   998 non-null    object
 9   Last_Login        998 non-null    object
 10  Latitude          998 non-null    float64
 11  Longitude         998 non-null    float64
dtypes: float64(2), int64(1), object(9)
memory usage: 93.7+ KB

In [0]:
df.isnull()

     Transaction_date  Product  Price  ...  Last_Login  Latitude  Longitude
0               False    False  False  ...       False     False      False
1               False    False  False  ...       False     False      False
2               False    False  False  ...       False     False      False
3               False    False  False  ...       False     False      False
4               False    False  False  ...       False     False      False
..                ...      ...    ...  ...         ...       ...        ...
993             False    False  False  ...       False     False      False
994             False    False  False  ...       False     False      False
995             False    False  False  ...       False     False      False
996             False    False  False  ...       False     False      False
997             False    False  False  ...       False     False      False

[998 rows x 12 columns]

In [0]:
df["State"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
993    False
994    False
995    False
996    False
997    False
Name: State, Length: 998, dtype: bool

In [0]:
df[df["State"].isnull()]

    Transaction_date        Product  ...   Latitude Longitude
146   1/17/2009 1:23  Silver Laptop  ...  29.289167     48.05

[1 rows x 12 columns]

In [0]:
df["State"].fillna("Rumaithiya",inplace=True)